# MaterialAspaint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MaterialAspaint Property
ParameterTypeId Class See Also
---
"As Paint"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MaterialAspaint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaterialAspaint As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MaterialAspaint {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace